Fix markdown lint errors in /doc and utilize GitHub's alerts in place of bolded `Note`s.
- Replaced `**Warning**` and `**Note**` with [GitHub alerts](https://docs.github.com/en/get-started/writing-on-github/getting-started-with-writing-and-formatting-on-github/basic-writing-and-formatting-syntax#alerts)
- Ran https://marketplace.visualstudio.com/items?itemName=DavidAnson.vscode-markdownlint linter across markdown files in /doc. This includes the following types of changes:
   - Adding blank lines around headers/lists
   - Fixing table spacing
   - Unifying bullet/list/heading style within a doc
- Replaced ASCII diagrams with Mermaid diagrams.
