--- a/doc/boot_and_update.md
+++ b/doc/boot_and_update.md
@@ -3,127 +3,151 @@
 
 General applications interaction diagram:
 
-```
-                              +------------+
-       +_____ [reboot] _______| MuditaOS   |
-       ↓                      | (boot.bin) |
-------------+                 +------------+
-|bootloader  |                        ↑
-|ecoboot.bin |--[load and boot]------→◇
-+------------+                        ↓
-    ↑  ↓                            +--------------+
-    |  |-----[update flag]---------→| Updater      |
-    |________ [reboot] ____________ | (updater.bin)|
-                                    +--------------+
+```mermaid
+flowchart LR
+  BL["bootloader<br/>(ecoboot.bin)"]
+  OS["MuditaOS<br/>(boot.bin)"] 
+  D{" "}
+  UP["Updater<br/>(updater.bin)"]
+  
+  OS-->|reboot| BL
+  D-.->OS
+  D-.->UP
+  BL-.-|load and boot| D
+  BL-.->|update flag| UP
+  UP-->|reboot| BL
 ```
 
 Simplified flow:
-- Bootloader always starts first
